In [1]:
import pandas as pd

In [9]:
# df = pd.read_csv("/Users/shahmdmesbahulislam/Documents/code/Data_Science_nd_ML/Pandas/stock_data_csv.csv",skiprows=1)
df = pd.read_csv("/Users/shahmdmesbahulislam/Documents/code/Data_Science_nd_ML/Pandas/stock_data_csv.csv",header=1)

# if you don't have header column you can do this:
# df = pd.read_csv("/Users/shahmdmesbahulislam/Documents/code/Data_Science_nd_ML/Pandas/stock_data_csv.csv",header=None,names=["ticker","eps","revenue","price","people"])

df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1   n.a     ratan tata

In [11]:
#sometimes our csv file can have so many rows.now if we want to read only 
#few rows then we can do this:
df = pd.read_csv("/Users/shahmdmesbahulislam/Documents/code/Data_Science_nd_ML/Pandas/stock_data_csv.csv",nrows=3)
df

  stock data Unnamed: 1 Unnamed: 2 Unnamed: 3  Unnamed: 4
0    tickers        eps    revenue      price      people
1      GOOGL      27.82         87        845  larry page
2        WMT       4.61        484         65        n.a.

In [14]:
#Clean up messy data from file "not available" and "n.a." replace with "na_values"
df = pd.read_csv("/Users/shahmdmesbahulislam/Documents/code/Data_Science_nd_ML/Pandas/stock_data_csv.csv",skiprows=1,na_values=["not available","n.a."])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3     RIL    NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [15]:
df = pd.read_csv("/Users/shahmdmesbahulislam/Documents/code/Data_Science_nd_ML/Pandas/stock_data_csv.csv",skiprows=1,na_values={
    'eps':["not available","n.a."],
    'revenue':["not available","n.a.",-1],
    'price':["not available","n.a."],
    "people":["not available","n.a."]
})
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3     RIL    NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [17]:
df.to_csv("new_stock_data_csv.csv",index=False)

In [18]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [19]:
df.to_csv("new_stock_data_csv.csv",columns=['tickers','eps'])

In [21]:
df.to_csv("new_stock_data_csv.csv",header=False,index=False)

In [26]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return "sam walton"
    return cell
def convert_eps_cell(cell):
    if cell == "not available":
        return None
    return cell

df = pd.read_excel("stock_data_excel.xlsx","stock_data_csv",converters={
    'people':convert_people_cell,
    'eps': convert_eps_cell
})

df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3     RIL    NaN       50  1023  mukesh ambani
4    TATA   5.60       -1   n.a     ratan tata

In [27]:
df.to_excel("new_stock_data_excel.xlsx",sheet_name="stocks",startrow=1,startcol=2,index=False)

In [29]:
#two dataframe in one excel file:
df_stocks = pd.DataFrame({
    'tickers':['GOOGLE',"WMT","MSFT"],
    'price':[845,65,64],
    'people':[30.37,14.26,30.97],
    'eps':[27.82,4.61,2.12]
})
df_weather = pd.DataFrame({
    'day':['1/1/2017','1/2/2017','1/3/2017'],
    'temperature':[32,35,28],
    'event':['Rain','Sunny','Snow']
})

with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer,sheet_name="stocks",index=False)
    df_weather.to_excel(writer,sheet_name="weather",index=False)